# SetPoints Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveByPoints..::..SetPoints Method
CurveByPoints Class See Also
---
Change the sequence of points interpolated by this curve.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetPoints(
	ReferencePointArray points
)
```

Visual Basic
---
```text
Public Sub SetPoints ( _
	points As ReferencePointArray _
)
```

Visual C++
---
```text
public:
void SetPoints(
	ReferencePointArray^ points
)
```

# ### Parameters
points
    Type: Autodesk.Revit.DB..::..ReferencePointArrayAn array of 2 or more ReferencePoints.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the array contains fewer than 2 points, when the array contains duplicates, or when adjacent points are located too close together. |

# See Also
CurveByPoints Class
Autodesk.Revit.DB Namespace